---
kind: property
id: P:Autodesk.Revit.DB.LocationCurve.Curve
zh: 曲线
source: html/b03df3be-687a-2ac8-e28d-2e038ecac142.htm
---
# Autodesk.Revit.DB.LocationCurve.Curve Property

**中文**: 曲线

Provides the ability to get and set the curve of a curve based element.

## Syntax (C#)
```csharp
public Curve Curve { get; set; }
```

## Remarks
This property can be used to set the location of curve based element to any desired
position. Many elements are curve based. Some examples are walls, beams and braces.